Revit 2027 API
AnalysisDisplayStyle.SetDiagramSettings Method
 Set diagram settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDiagramSettings(
	AnalysisDisplayDiagramSettings diagramSettings
)
Public Sub SetDiagramSettings (
	diagramSettings As AnalysisDisplayDiagramSettings
)
public:
void SetDiagramSettings(
	AnalysisDisplayDiagramSettings^ diagramSettings
)
member SetDiagramSettings :
        diagramSettings : AnalysisDisplayDiagramSettings -> unit
Parameters
diagramSettings AnalysisDisplayDiagramSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  diagram settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace